saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.Kinetis_K20_DFP.1.7.0.pdsc
    <condition id="K20 50MHz">
      <description>NXP Kinetis K20 device series</description>
      <require Dvendor="NXP:11" Dname="MK20DX128xxx5"/>
    </condition>

    <!-- device Conditions -->
    <condition id="MK20D5">
      <description>NXP Kinetis MK20D5 device</description>
      <require Dvendor="NXP:11"/>
      <accept  Dname="MK20DN128xxx5"/>
      <accept  Dname="MK20DN32xxx5"/>
      <accept  Dname="MK20DN64xxx5"/>
      <accept  Dname="MK20DX128xxx5"/>
      <accept  Dname="MK20DX32xxx5"/>
      <accept  Dname="MK20DX64xxx5"/>
    </condition>

    <condition id="MK20D10">
      <description>NXP Kinetis MK20D10 device</description>
      <require Dvendor="NXP:11"/>
      <accept  Dname="MK20DN512xxx10"/>
      <accept  Dname="MK20DX128xxx10"/>
      <accept  Dname="MK20DX256xxx10"/>
    </condition>

    <condition id="MK20D7">
      <description>NXP Kinetis MK20D7 device</description>
      <require Dvendor="NXP:11"/>
      <accept  Dname="MK20DX128xxx7"/>
      <accept  Dname="MK20DX256xxx7"/>
      <accept  Dname="MK20DX64xxx7"/>
    </condition>

    <condition id="MK20F12">
      <description>NXP Kinetis MK20F12 device</description>
      <require Dvendor="NXP:11"/>
      <accept  Dname="MK20FN1M0xxx12"/>
      <accept  Dname="MK20FX512xxx12"/>
    </condition>

    <condition id="MK21F10">
      <description>NXP Kinetis MK21F10 device</description>
      <require Dvendor="NXP:11"/>
      <accept  Dname="MK21FN1M0xxx10"/>
      <accept  Dname="MK21FX512xxx10"/>
    </condition>

    <condition id="MK22F10">
      <description>NXP Kinetis MK22F10 device</description>
      <require Dvendor="NXP:11"/>
      <accept  Dname="MK22FN1M0xxx10"/>
      <accept  Dname="MK22FX512xxx10"/>
    </condition>

    <!-- device + CMSIS Conditions -->
    <condition id="MK20D5 CMSIS">
      <description>NXP Kinetis MK20D5 device and CMSIS-CORE</description>
      <require condition="MK20D5"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="MK20D7 CMSIS">
      <description>NXP Kinetis MK20D7 device and CMSIS-CORE</description>
      <require condition="MK20D7"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="MK20D10 CMSIS">
      <description>NXP Kinetis MK20D10 device and CMSIS-CORE</description>
      <require condition="MK20D10"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="MK20F12 CMSIS">
      <description>NXP Kinetis MK20F12 device and CMSIS-CORE</description>
      <require condition="MK20F12"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="MK21F10 CMSIS">
      <description>NXP Kinetis MK21F10 device and CMSIS-CORE</description>
      <require condition="MK21F10"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="MK22F10 CMSIS">
      <description>NXP Kinetis MK22F10 device and CMSIS-CORE</description>
      <require condition="MK22F10"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <!-- device + Driver Conditions -->
    <condition id="MK20D5 GPIO DMA RTOS">
      <description>NXP Kinetis K20D5 Series with GPIO and DMA Driver</description>
      <require condition="MK20D5"/>
      <require Cclass ="Device" Cgroup="GPIO" />
      <require Cclass ="Device" Cgroup="DMA" />
      <accept Cclass="CMSIS" Cgroup="RTOS"/>
      <accept Cclass="CMSIS" Cgroup="RTOS2"/>
    </condition>

    <condition id="MK20D5 CMSIS RTOS">
      <description>NXP Kinetis K20D5 Series with CMSIS and RTOS</description>
      <require condition="MK20D5"/>
      <require Cclass ="CMSIS" Cgroup="CORE"/>
      <accept Cclass="CMSIS" Cgroup="RTOS"/>
      <accept Cclass="CMSIS" Cgroup="RTOS2"/>
    </condition>
  </conditions>

  <components>
    <!-- Startup MK20D5 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MK20D5 CMSIS">
      <description>System Startup for NXP Kinetis MK20D5 devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MK20D5.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MK20D5.c"       attr="config" version="1.0.0"/>

        <file category="header"  name="RTE_Driver/Config/RTE_Device.h"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MK20D10 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MK20D10 CMSIS">
      <description>System Startup for NXP Kinetis MK20D10 devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MK20D10.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MK20D10.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MK20D7 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MK20D7 CMSIS">
      <description>System Startup for NXP Kinetis MK20D7 devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MK20D7.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MK20D7.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MK20F12 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MK20F12 CMSIS">
      <description>System Startup for NXP Kinetis MK20F12 devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MK20F12.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MK20F12.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

